CSI API ETABS v1

# cTower Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cTower

    Public Interface cTower

    Dim instance As cTower

    public interface class cTower

    type cTower =  interface end

The cTower type exposes the following members.

Methods

| Name| Description
---|---|---
|
AddCopyOfTower|
|
AddNewTower|
|
AllowMultipleTowers|
|
DeleteTower|
|
GetActiveTower|
|
GetNameList|
|
RenameTower|
|
SetActiveTower|
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com